Revit 2027 API
FormatOptions.CanSuppressTrailingZeros(ForgeTypeId) Method
 Checks whether trailing zeros can be suppressed for a given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanSuppressTrailingZeros(
	ForgeTypeId unitTypeId
)
Public Shared Function CanSuppressTrailingZeros (
	unitTypeId As ForgeTypeId
) As Boolean
public:
static bool CanSuppressTrailingZeros(
	ForgeTypeId^ unitTypeId
)
static member CanSuppressTrailingZeros :
        unitTypeId : ForgeTypeId -> bool
Parameters
unitTypeId ForgeTypeId
 Identifier of the unit.
Return Value
Boolean
 True if trailing zeros can be suppressed, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FormatOptions Class
CanSuppressTrailingZeros Overload
Autodesk.Revit.DB Namespace